hparracho/Xarmlib/include/targets/LPC84x/lpc84x_cmsis.h
// ----------------------------------------------------------------------------
// @file    lpc84x_cmsis.h
// @brief   CMSIS Core Peripheral Access Layer header file for NXP LPC84x MCUs.
// @date    9 March 2018
// ----------------------------------------------------------------------------
//
// Xarmlib 0.1.0 - https://github.com/hparracho/Xarmlib
// Copyright (c) 2018 Helder Parracho (hparracho@gmail.com)
//
// Permission is hereby granted, free of charge, to any person obtaining a
// copy of this software and associated documentation files (the "Software"),
// to deal in the Software without restriction, including without limitation
// the rights to use, copy, modify, merge, publish, distribute, sublicense,
// and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included
// in all copies or substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS
// OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
// FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL
// THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
// LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
// FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER
// DEALINGS IN THE SOFTWARE.
//
// ----------------------------------------------------------------------------




// ----------------------------------------------------------------------------
// This file is based on the code from LPC845 Example Code Bundle for
// MCUXpresso REV 1.2 provided by NXP.
// https://www.nxp.com/downloads/en/software/LPC845-Example-Code-Bundle-MCUXpresso.zip
// ----------------------------------------------------------------------------




#ifndef __XARMLIB_TARGETS_LPC84X_LPC84X_CMSIS_H
#define __XARMLIB_TARGETS_LPC84X_LPC84X_CMSIS_H

#ifdef __cplusplus
extern "C" {
#endif

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wpedantic"
// ISO C++ prohibits anonymous structs [-Wpedantic]




// ----------------------------------------------------------------------------
// Interrupt Number Definition
// ----------------------------------------------------------------------------
typedef enum IRQn
{
    // Cortex-M0+ Processor Exceptions Numbers
    Reset_IRQn                  = -15,      // 1 Reset Vector, invoked on Power up and warm reset
    NonMaskableInt_IRQn         = -14,      // 2 Non Maskable Interrupt
    HardFault_IRQn              = -13,      // 3 Cortex-M0 Hard Fault Interrupt
    SVCall_IRQn                 = -5,       // 11 Cortex-M0 SV Call Interrupt
    DebugMonitor_IRQn           = -4,       // 12 Debug Monitor
    PendSV_IRQn                 = -2,       // 14 Cortex-M0 Pend SV Interrupt
    SysTick_IRQn                = -1,       // 15 Cortex-M0 System Tick Interrupt

    // LPC84x Specific Interrupt Numbers
    SPI0_IRQn                   = 0,        // SPI0
    SPI1_IRQn                   = 1,        // SPI1
    DAC0_IRQn                   = 2,        // DAC0 Interrupt
    UART0_IRQn                  = 3,        // USART0
    UART1_IRQn                  = 4,        // USART1
    UART2_IRQn                  = 5,        // USART2
    I2C1_IRQn                   = 7,        // I2C1
    I2C0_IRQn                   = 8,        // I2C0
    SCT_IRQn                    = 9,        // SCT
    MRT_IRQn                    = 10,       // MRT
    CMP_IRQn                    = 11,       // Analog Comparator shared slot with Cap Touch
    WDT_IRQn                    = 12,       // WDT
    BOD_IRQn                    = 13,       // BOD
    FLASH_IRQn                  = 14,       // FLASH
    WKT_IRQn                    = 15,       // WKT Interrupt
    ADC_SEQA_IRQn               = 16,       // ADC Seq. A
    ADC_SEQB_IRQn               = 17,       // ADC Seq. B
    ADC_THCMP_IRQn              = 18,       // ADC Thresh Comp
    ADC_OVR_IRQn                = 19,       // ADC overrun
    DMA_IRQn                    = 20,       // DMA
    I2C2_IRQn                   = 21,       // I2C2
    I2C3_IRQn                   = 22,       // I2C3
    CTIMER0_IRQn                = 23,       // Timer 0 Interrupt
    PININT0_IRQn                = 24,       // External Interrupt 0
    PININT1_IRQn                = 25,       // External Interrupt 1
    PININT2_IRQn                = 26,       // External Interrupt 2
    PININT3_IRQn                = 27,       // External Interrupt 3
    PININT4_IRQn                = 28,       // External Interrupt 4
    PININT5_IRQn                = 29,       // External Interrupt 5 shared slot with DAC1
    PININT6_IRQn                = 30,       // External Interrupt 6 shared slot with UART3
    PININT7_IRQn                = 31,       // External Interrupt 7 shared slot with UART4
} IRQn_Type;

#define CAPT_IRQn   CMP_IRQn                // Analog Comparator shared slot with Cap Touch
#define DAC1_IRQn   PININT5_IRQn            // Pin int. 5 shared slot with DAC1
#define UART3_IRQn  PININT6_IRQn            // Pin int. 6 shared slot with UART3
#define UART4_IRQn  PININT7_IRQn            // Pin int. 7 shared slot with UART4




// ----------------------------------------------------------------------------
// Processor and Core Peripheral Section
// ----------------------------------------------------------------------------

// Configuration of the Cortex-M0+ Processor and Core Peripherals
#define __CM0PLUS_REV           0x0001
#define __MPU_PRESENT           0           // MPU present or not
#define __NVIC_PRIO_BITS        2           // Number of Bits used for Priority Levels
#define __Vendor_SysTickConfig  0           // Set to 1 if different SysTick Config is used




#include "core_cm0plus.h"                   // Cortex-M0+ processor and core peripherals




// ----------------------------------------------------------------------------
// Device Specific Peripheral Registers structures
// ----------------------------------------------------------------------------



// ------------ System Control (SYSCON) ---------------------------------------
typedef struct
{
    __IO uint32_t SYSMEMREMAP;              // (offset: 0x000)       System memory remap
         uint32_t RESERVED0;                // (offset: 0x004)       RESERVED
    __IO uint32_t SYSPLLCTRL;               // (offset: 0x008)       System PLL control
    __I  uint32_t SYSPLLSTAT;               // (offset: 0x00C)       System PLL status
         uint32_t RESERVED1[4];             // (offset: 0x010-0x01C) RESERVED
    __IO uint32_t SYSOSCCTRL;               // (offset: 0x020)       System oscillator control
    __IO uint32_t WDTOSCCTRL;               // (offset: 0x024)       Watchdog oscillator control
    __IO uint32_t FROOSCCTRL;               // (offset: 0x028)       FRO oscillator control
         uint32_t RESERVED2;                // (offset: 0x02C)       RESERVED
    __IO uint32_t FRODIRECTCLKUEN;          // (offset: 0x030)       FRO direct clock source update
         uint32_t RESERVED3;                // (offset: 0x034)       RESERVED
    __IO uint32_t SYSRSTSTAT;               // (offset: 0x038)       System reset status 0
    __IO uint32_t FAIMROWPROTECTCTRL;       // (offset: 0x03C)       FAIM row protect control
    __IO uint32_t SYSPLLCLKSEL;             // (offset: 0x040)       System PLL clock source select 0
    __IO uint32_t SYSPLLCLKUEN;             // (offset: 0x044)       System PLL clock source update
    __IO uint32_t MAINCLKPLLSEL;            // (offset: 0x048)       Main clock pll source select 0
    __IO uint32_t MAINCLKPLLUEN;            // (offset: 0x04C)       Main clock pll source update enable
    __IO uint32_t MAINCLKSEL;               // (offset: 0x050)       Main clock source select
    __IO uint32_t MAINCLKUEN;               // (offset: 0x054)       Main clock source update enable
    __IO uint32_t SYSAHBCLKDIV;             // (offset: 0x058)       System clock divider
         uint32_t RESERVED4;                // (offset: 0x05C)       RESERVED
    __IO uint32_t CAPTCLKSEL;               // (offset: 0x060)       CAPT clock source select
    __IO uint32_t ADCCLKSEL;                // (offset: 0x064)       ADC clock source select
    __IO uint32_t ADCCLKDIV;                // (offset: 0x068)       ADC clock divider
    __IO uint32_t SCTCLKSEL;                // (offset: 0x06C)       SCT clock source select
    __IO uint32_t SCTCLKDIV;                // (offset: 0x070)       SCT clock divider
    __IO uint32_t EXTCLKSEL;                // (offset: 0x074)       External clock source select
         uint32_t RESERVED5[2];             // (offset: 0x078-0x07C) RESERVED
    union
    {
        __IO uint32_t SYSAHBCLKCTRL[2];
        struct
        {
            __IO uint32_t SYSAHBCLKCTRL0;   // (offset: 0x080) System clock group 0 control
            __IO uint32_t SYSAHBCLKCTRL1;   // (offset: 0x084) System clock group 1 control
        };
    };
    union
    {
        __IO uint32_t PRESETCTRL[2];
        struct
        {
            __IO uint32_t PRESETCTRL0;      // (offset: 0x088) Peripheral reset group 0 control
            __IO uint32_t PRESETCTRL1;      // (offset: 0x08C) Peripheral reset group 1 control
        };
    };
    union
    {
        __IO uint32_t FCLKSEL[11];
        struct
        {
            __IO uint32_t UART0CLKSEL;      // (offset: 0x090) FCLK0 clock source select
            __IO uint32_t UART1CLKSEL;      // (offset: 0x094) FCLK1 clock source select
            __IO uint32_t UART2CLKSEL;      // (offset: 0x098) FCLK2 clock source select
            __IO uint32_t UART3CLKSEL;      // (offset: 0x09C) FCLK3 clock source select
            __IO uint32_t UART4CLKSEL;      // (offset: 0x0A0) FCLK4 clock source select
            __IO uint32_t I2C0CLKSEL;       // (offset: 0x0A4) FCLK5 clock source select
            __IO uint32_t I2C1CLKSEL;       // (offset: 0x0A8) FCLK6 clock source select
            __IO uint32_t I2C2CLKSEL;       // (offset: 0x0AC) FCLK7 clock source select
            __IO uint32_t I2C3CLKSEL;       // (offset: 0x0B0) FCLK8 clock source select
            __IO uint32_t SPI0CLKSEL;       // (offset: 0x0B4) FCLK9 clock source select
            __IO uint32_t SPI1CLKSEL;       // (offset: 0x0B8) FCLK10 clock source select
        };
    };
         uint32_t RESERVED6;                // (offset: 0x0BC)       RESERVED
    __IO uint32_t EFLASHREFCLKDIV;          // (offset: 0x0C0)       EFLASH REF clock divider
    __IO uint32_t FAIMREFCLKDIV;            // (offset: 0x0C4)       FAIM REF clock divider
         uint32_t RESERVED7[2];             // (offset: 0x0C8-0x0CC) RESERVED
    __IO uint32_t FRG0DIV;                  // (offset: 0x0D0)       FRG0 divider value
    __IO uint32_t FRG0MULT;                 // (offset: 0x0D4)       FRG0 multiplier value
    __IO uint32_t FRG0CLKSEL;               // (offset: 0x0D8)       FRG0 clock source select
         uint32_t RESERVED8;                // (offset: 0x0DC)       RESERVED
    __IO uint32_t FRG1DIV;                  // (offset: 0x0E0)       FRG1 divider value
    __IO uint32_t FRG1MULT;                 // (offset: 0x0E4)       FRG1 multiplier value
    __IO uint32_t FRG1CLKSEL;               // (offset: 0x0E8)       FRG1 clock source select
         uint32_t RESERVED9;                // (offset: 0x0EC)       RESERVED
    __IO uint32_t CLKOUTSEL;                // (offset: 0x0F0)       CLKOUT clock source select
    __IO uint32_t CLKOUTDIV;                // (offset: 0x0F4)       CLKOUT clock divider
         uint32_t RESERVED10;               // (offset: 0x0F8)       RESERVED
    __IO uint32_t EXTTRACECMD;              // (offset: 0x0FC)       External trace buffer command
    __I  uint32_t PIOPORCAP0;               // (offset: 0x100)       POR captured PIO0 status 0
    __I  uint32_t PIOPORCAP1;               // (offset: 0x104)       POR captured PIO1 status 0
         uint32_t RESERVED11[11];           // (offset: 0x108-0x130) RESERVED
    union
    {
        __IO uint32_t IOCONCLKDIV[7];
        struct
        {
            __IO uint32_t IOCONCLKDIV6;     // (offset: 0x134) Peripheral clock 6 to the IOCON block for programmable glitch filter
            __IO uint32_t IOCONCLKDIV4;     // (offset: 0x13C) Peripheral clock 4 to the IOCON block for programmable glitch filter
            __IO uint32_t IOCONCLKDIV5;     // (offset: 0x138) Peripheral clock 5 to the IOCON block for programmable glitch filter
            __IO uint32_t IOCONCLKDIV3;     // (offset: 0x140) Peripheral clock 3 to the IOCON block for programmable glitch filter
            __IO uint32_t IOCONCLKDIV2;     // (offset: 0x144) Peripheral clock 2 to the IOCON block for programmable glitch filter
            __IO uint32_t IOCONCLKDIV1;     // (offset: 0x148) Peripheral clock 1 to the IOCON block for programmable glitch filter
            __IO uint32_t IOCONCLKDIV0;     // (offset: 0x14C) Peripheral clock 0 to the IOCON block for programmable glitch filter
        };
    };
    __IO uint32_t BODCTRL;                  // (offset: 0x150)       Brown-Out Detect
    __IO uint32_t SYSTCKCAL;                // (offset: 0x154)       System tick counter calibration
         uint32_t RESERVED12[6];            // (offset: 0x158-0x16C) RESERVED
    __IO uint32_t IRQLATENCY;               // (offset: 0x170)       IRQ delay. Allows trade-off between interrupt latency and determinism.
    __IO uint32_t NMISRC;                   // (offset: 0x174)       NMI Source Control
    union
    {
        __IO uint32_t PINTSEL[8];
        struct
        {
            __IO uint32_t PINTSEL0;         // (offset: 0x178) GPIO Pin Interrupt Select 0
            __IO uint32_t PINTSEL1;         // (offset: 0x17C) GPIO Pin Interrupt Select 1
            __IO uint32_t PINTSEL2;         // (offset: 0x180) GPIO Pin Interrupt Select 2
            __IO uint32_t PINTSEL3;         // (offset: 0x184) GPIO Pin Interrupt Select 3
            __IO uint32_t PINTSEL4;         // (offset: 0x188) GPIO Pin Interrupt Select 4
            __IO uint32_t PINTSEL5;         // (offset: 0x18C) GPIO Pin Interrupt Select 5
            __IO uint32_t PINTSEL6;         // (offset: 0x190) GPIO Pin Interrupt Select 6
            __IO uint32_t PINTSEL7;         // (offset: 0x194) GPIO Pin Interrupt Select 7
        };
    };
         uint32_t RESERVED13[27];           // (offset: 0x198-0x200) RESERVED
    __IO uint32_t STARTERP0;                // (offset: 0x204)       Start logic 0 pin wake-up enable
         uint32_t RESERVED14[3];            // (offset: 0x208-0x210) RESERVED
    __IO uint32_t STARTERP1;                // (offset: 0x214)       Start logic 1 interrupt wake-up enable
         uint32_t RESERVED15[6];            // (offset: 0x218-0x22C) RESERVED
    __IO uint32_t PDSLEEPCFG;               // (offset: 0x230)       Power-down states in deep-sleep mode
    __IO uint32_t PDAWAKECFG;               // (offset: 0x234)       Power-down states for wake-up from deep-sleep
    __IO uint32_t PDRUNCFG;                 // (offset: 0x238)       Power configuration
         uint32_t RESERVED16[111];          // (offset: 0x23C-0x3F4) RESERVED
    __I  uint32_t DEVICE_ID;                // (offset: 0x3F8)       Device ID
} LPC_SYSCON_T;




// ------------ I/O Configuration (IOCON) -------------------------------------
typedef struct
{
    union
    {
        __IO uint32_t PIO[56];
        struct
        {
            __IO uint32_t PIO0_17;          // (offset: 0x00)
            __IO uint32_t PIO0_13;          // (offset: 0x04)
            __IO uint32_t PIO0_12;          // (offset: 0x08)
            __IO uint32_t PIO0_5;           // (offset: 0x0C)
            __IO uint32_t PIO0_4;           // (offset: 0x10)
            __IO uint32_t PIO0_3;           // (offset: 0x14)
            __IO uint32_t PIO0_2;           // (offset: 0x18)
            __IO uint32_t PIO0_11;          // (offset: 0x1C)
            __IO uint32_t PIO0_10;          // (offset: 0x20)
            __IO uint32_t PIO0_16;          // (offset: 0x24)
            __IO uint32_t PIO0_15;          // (offset: 0x28)
            __IO uint32_t PIO0_1;           // (offset: 0x2C)
                 uint32_t RESERVED0;        // (offset: 0x30) RESERVED
            __IO uint32_t PIO0_9;           // (offset: 0x34)
            __IO uint32_t PIO0_8;           // (offset: 0x38)
            __IO uint32_t PIO0_7;           // (offset: 0x3C)
            __IO uint32_t PIO0_6;           // (offset: 0x40)
            __IO uint32_t PIO0_0;           // (offset: 0x44)
            __IO uint32_t PIO0_14;          // (offset: 0x48)
                 uint32_t RESERVED1;        // (offset: 0x4C) RESERVED
            __IO uint32_t PIO0_28;          // (offset: 0x50)
            __IO uint32_t PIO0_27;          // (offset: 0x54)
            __IO uint32_t PIO0_26;          // (offset: 0x58)
            __IO uint32_t PIO0_25;          // (offset: 0x5C)
            __IO uint32_t PIO0_24;          // (offset: 0x60)
            __IO uint32_t PIO0_23;          // (offset: 0x64)
            __IO uint32_t PIO0_22;          // (offset: 0x68)
            __IO uint32_t PIO0_21;          // (offset: 0x6C)
            __IO uint32_t PIO0_20;          // (offset: 0x70)
            __IO uint32_t PIO0_19;          // (offset: 0x74)
            __IO uint32_t PIO0_18;          // (offset: 0x78)
            __IO uint32_t PIO1_8;           // (offset: 0x7C)
            __IO uint32_t PIO1_9;           // (offset: 0x80)
            __IO uint32_t PIO1_12;          // (offset: 0x84)
            __IO uint32_t PIO1_13;          // (offset: 0x88)
            __IO uint32_t PIO0_31;          // (offset: 0x8C)
            __IO uint32_t PIO1_0;           // (offset: 0x90)
            __IO uint32_t PIO1_1;           // (offset: 0x94)
            __IO uint32_t PIO1_2;           // (offset: 0x98)
            __IO uint32_t PIO1_14;          // (offset: 0x9C)
            __IO uint32_t PIO1_15;          // (offset: 0xA0)
            __IO uint32_t PIO1_3;           // (offset: 0xA4)
            __IO uint32_t PIO1_4;           // (offset: 0xA8)
            __IO uint32_t PIO1_5;           // (offset: 0xAC)
            __IO uint32_t PIO1_16;          // (offset: 0xB0)
            __IO uint32_t PIO1_17;          // (offset: 0xB4)
            __IO uint32_t PIO1_6;           // (offset: 0xB8)
            __IO uint32_t PIO1_18;          // (offset: 0xBC)
            __IO uint32_t PIO1_19;          // (offset: 0xC0)
            __IO uint32_t PIO1_7;           // (offset: 0xC4)
            __IO uint32_t PIO0_29;          // (offset: 0xC8)
            __IO uint32_t PIO0_30;          // (offset: 0xCC)
            __IO uint32_t PIO1_20;          // (offset: 0xD0)
            __IO uint32_t PIO1_21;          // (offset: 0xD4)
            __IO uint32_t PIO1_11;          // (offset: 0xD8)
            __IO uint32_t PIO1_10;          // (offset: 0xDC)
        };
    };
} LPC_IOCON_T;




// ------------ FLASH Memory Controller (FMC) ---------------------------------
typedef struct
{
         uint32_t RESERVED0[4];             // (offset: 0x00-0x0C) RESERVED
    __IO uint32_t FLASHCFG;                 // (offset: 0x10)      Flash configuration register
         uint32_t RESERVED1[3];             // (offset: 0x14-0x1C) RESERVED
    __IO uint32_t FMSSTART;                 // (offset: 0x20)      Signature start address register
    __IO uint32_t FMSSTOP;                  // (offset: 0x24)      Signature stop-address register
         uint32_t RESERVED2;                // (offset: 0x28)      RESERVED
    __I  uint32_t FMSW0;                    // (offset: 0x2C)      Signature word
} LPC_FMC_T;




// ------------ Power Management Unit (PMU) -----------------------------------
typedef struct
{
    __IO uint32_t PCON;                     // (offset: 0x000) Power control Register
    __IO uint32_t GPREG0;                   // (offset: 0x004) General purpose Register 0
    __IO uint32_t GPREG1;                   // (offset: 0x008) General purpose Register 1
    __IO uint32_t GPREG2;                   // (offset: 0x00C) General purpose Register 2
    __IO uint32_t GPREG3;                   // (offset: 0x010) General purpose Register 3
    __IO uint32_t DPDCTRL;                  // (offset: 0x014) Deep power-down control register
} LPC_PMU_T;




// ------------ Switch Matrix (SWM) -------------------------------------------
typedef struct
{
    union
    {
        __IO uint32_t PINASSIGN[15];
        struct
        {
            __IO uint32_t PINASSIGN0;       // (offset: 0x000)
            __IO uint32_t PINASSIGN1;       // (offset: 0x004)
            __IO uint32_t PINASSIGN2;       // (offset: 0x008)
            __IO uint32_t PINASSIGN3;       // (offset: 0x00C)
            __IO uint32_t PINASSIGN4;       // (offset: 0x010)
            __IO uint32_t PINASSIGN5;       // (offset: 0x014)
            __IO uint32_t PINASSIGN6;       // (offset: 0x018)
            __IO uint32_t PINASSIGN7;       // (offset: 0x01C)
            __IO uint32_t PINASSIGN8;       // (offset: 0x020)
            __IO uint32_t PINASSIGN9;       // (offset: 0x024)
            __IO uint32_t PINASSIGN10;      // (offset: 0x028)
            __IO uint32_t PINASSIGN11;      // (offset: 0x02C)
            __IO uint32_t PINASSIGN12;      // (offset: 0x030)
            __IO uint32_t PINASSIGN13;      // (offset: 0x034)
            __IO uint32_t PINASSIGN14;      // (offset: 0x038)
        };
    };
         uint32_t RESERVED[97];             // (offset: 0x03C-0x1BC) RESERVED
    __IO uint32_t PINENABLE0;               // (offset: 0x1C0)
    __IO uint32_t PINENABLE1;               // (offset: 0x1C4)
} LPC_SWM_T;




