hparracho/Xarmlib/include/targets/LPC84x/lpc84x_cmsis.h
// ------------ General Purpose I/O (GPIO) ------------------------------------
typedef struct
{
    __IO uint8_t  B0[32];                   // (offset: 0x0000-0x001F) Byte pin registers P0.0 - P0.31
    __IO uint8_t  B1[32];                   // (offset: 0x0020-0x003F) Byte pin registers P1.0 - P1.31
         uint8_t  RESERVED0[4032];          // (offset: 0x0040-0x0FFF) RESERVED
    __IO uint32_t W0[32];                   // (offset: 0x1000-0x107C) Word pin registers P0.0 - P0.31
    __IO uint32_t W1[32];                   // (offset: 0x1080-0x10FC) Word pin registers P1.0 - P1.31
         uint32_t RESERVED1[960];           // (offset: 0x1100-0x1FFC) (960d = 0x3C0) RESERVED
    union
    {
        __IO uint32_t DIR[2];               // (offset: 0x2000-0x2004)
        struct
        {
            __IO uint32_t DIR0;             // (offset: 0x2000)
            __IO uint32_t DIR1;             // (offset: 0x2004)
        };
    };
    uint32_t RESERVED2[30];                 // (offset: 0x2008-0x207C) RESERVED
    union
    {
        __IO uint32_t MASK[2];              // (offset: 0x2080-0x2084)
        struct
        {
            __IO uint32_t MASK0;            // (offset: 0x2080)
            __IO uint32_t MASK1;            // (offset: 0x2084)
        };
    };
    uint32_t RESERVED3[30];                 // (offset: 0x2088-0x20FC) RESERVED
    union
    {
        __IO uint32_t PIN[2];               // (offset: 0x2100-0x2104)
        struct
        {
            __IO uint32_t PIN0;             // (offset: 0x2100)
            __IO uint32_t PIN1;             // (offset: 0x2104)
        };
    };
    uint32_t RESERVED4[30];                 // (offset: 0x2108-0x217C) RESERVED
    union
    {
        __IO uint32_t MPIN[2];              // (offset: 0x22180-0x2184)
        struct
        {
            __IO uint32_t MPIN0;            // (offset: 0x2180)
            __IO uint32_t MPIN1;            // (offset: 0x2184)
        };
    };
    uint32_t RESERVED5[30];                 // (offset: 0x2188-0x21FC) RESERVED
    union
    {
        __IO uint32_t SET[2];               // (offset: 0x2200-0x2204)
        struct
        {
            __IO uint32_t SET0;             // (offset: 0x2200)
            __IO uint32_t SET1;             // (offset: 0x2204)
        };
    };
    uint32_t RESERVED6[30];                 // (offset: 0x2208-0x227C) RESERVED
    union
    {
        __O  uint32_t CLR[2];               // (offset: 0x2280-0x2284)
        struct
        {
            __O  uint32_t CLR0;             // (offset: 0x2280)
            __O  uint32_t CLR1;             // (offset: 0x2284)
        };
    };
    uint32_t RESERVED7[30];                 // (offset: 0x2288-0x22FC) RESERVED
    union
    {
        __O  uint32_t NOT[2];               // (offset: 0x2300-0x2304)
        struct
        {
            __O  uint32_t NOT0;             // (offset: 0x2300)
            __O  uint32_t NOT1;             // (offset: 0x2304)
        };
    };
    uint32_t RESERVED8[30];                 // (offset: 0x2308-0x237C) RESERVED
    union
    {
        __O  uint32_t DIRSET[2];            // (offset: 0x2380-0x2384)
        struct
        {
            __O  uint32_t DIRSET0;          // (offset: 0x2380)
            __O  uint32_t DIRSET1;          // (offset: 0x2384)
        };
    };
    uint32_t RESERVED9[30];                 // (offset: 0x2388-0x23FC) RESERVED
    union
    {
        __O  uint32_t DIRCLR[2];            // (offset: 0x2400-0x2404)
        struct
        {
            __O  uint32_t DIRCLR0;          // (offset: 0x2400)
            __O  uint32_t DIRCLR1;          // (offset: 0x2404)
        };
    };
    uint32_t RESERVED10[30];                // (offset: 0x2408-0x247C) RESERVED
    union
    {
        __O  uint32_t DIRNOT[2];            // (offset: 0x2480-0x2484)
        struct
        {
            __O  uint32_t DIRNOT0;          // (offset: 0x2480)
            __O  uint32_t DIRNOT1;          // (offset: 0x2484)
        };
    };
} LPC_GPIO_T;




// ------------ Pin Interrupts and Pattern Match (PIN_INT) --------------------
typedef struct
{
    __IO uint32_t ISEL;                     // (offset: 0x00) Pin Interrupt Mode register
    __IO uint32_t IENR;                     // (offset: 0x04) Pin Interrupt Enable (Rising) register
    __IO uint32_t SIENR;                    // (offset: 0x08) Set Pin Interrupt Enable (Rising) register
    __IO uint32_t CIENR;                    // (offset: 0x0C) Clear Pin Interrupt Enable (Rising) register
    __IO uint32_t IENF;                     // (offset: 0x10) Pin Interrupt Enable Falling Edge / Active Level register
    __IO uint32_t SIENF;                    // (offset: 0x14) Set Pin Interrupt Enable Falling Edge / Active Level register
    __IO uint32_t CIENF;                    // (offset: 0x18) Clear Pin Interrupt Enable Falling Edge / Active Level address
    __IO uint32_t RISE;                     // (offset: 0x1C) Pin Interrupt Rising Edge register
    __IO uint32_t FALL;                     // (offset: 0x20) Pin Interrupt Falling Edge register
    __IO uint32_t IST;                      // (offset: 0x24) Pin Interrupt Status register
    __IO uint32_t PMCTRL;                   // (offset: 0x28) GPIO pattern match interrupt control register
    __IO uint32_t PMSRC;                    // (offset: 0x2C) GPIO pattern match interrupt bit-slice source register
    __IO uint32_t PMCFG;                    // (offset: 0x30) GPIO pattern match interrupt bit slice configuration register
} LPC_PIN_INT_T;




// ------------ CRC Engine (CRC) ----------------------------------------------
typedef struct
{
    __IO uint32_t MODE;
    __IO uint32_t SEED;
    union
    {
        __I  uint32_t SUM;
        __O  uint32_t WR_DATA;
    };
} LPC_CRC_T;




// ------------ Comparator (CMP) ----------------------------------------------
typedef struct
{
    __IO uint32_t CTRL;                     // (offset: 0x00) Comparator control register
    __IO uint32_t LAD;                      // (offset: 0x04) Voltage ladder register
} LPC_CMP_T;






// ------------ Self Wakeup Timer (WKT) ---------------------------------------
typedef struct
{
    __IO uint32_t CTRL;                     // (offset: 0x00)      Alarm / Wakeup Timer Control register
         uint32_t RESERVED[2];              // (offset: 0x04-0x08) RESERVED
    __IO uint32_t COUNT;                    // (offset: 0x0C)      Alarm / Wakeup TImer counter register
} LPC_WKT_T;




// ------------ Multi-Rate Timer(MRT) -----------------------------------------
typedef struct
{
    __IO uint32_t INTVAL;
    __IO uint32_t TIMER;
    __IO uint32_t CTRL;
    __IO uint32_t STAT;
} LPC_MRT_CHANNEL_T;

typedef struct
{
    LPC_MRT_CHANNEL_T   CHANNEL[4];         // (offset: 0x00-0x3C)

         uint32_t       RESERVED[45];       // (offset: 0x40-0xF0) RESERVED
    __IO uint32_t       IDLE_CH;            // (offset: 0xF4)
    __IO uint32_t       IRQ_FLAG;           // (offset: 0xF8)
} LPC_MRT_T;




// ------------ Universal Asynchronous Receiver Transmitter (USART) -----------
typedef struct
{
    __IO uint32_t CFG;
    __IO uint32_t CTL;
    __IO uint32_t STAT;
    __IO uint32_t INTENSET;
    __O  uint32_t INTENCLR;
    __I  uint32_t RXDAT;
    __I  uint32_t RXDATSTAT;
    __IO uint32_t TXDAT;
    __IO uint32_t BRG;
    __I  uint32_t INTSTAT;
    __IO uint32_t OSR;
    __IO uint32_t ADDR;
} LPC_USART_T;




// ------------ Serial Peripheral Interface (SPI) -----------------------------
typedef struct
{
    __IO uint32_t CFG;
    __IO uint32_t DLY;
    __IO uint32_t STAT;
    __IO uint32_t INTENSET;
    __O  uint32_t INTENCLR;
    __I  uint32_t RXDAT;
    __IO uint32_t TXDATCTL;
    __IO uint32_t TXDAT;
    __IO uint32_t TXCTL;
    __IO uint32_t DIV;
    __I  uint32_t INTSTAT;
} LPC_SPI_T;




// ------------ Inter-Integrated Circuit (I2C) --------------------------------
typedef struct
{
    __IO uint32_t CFG;
    __IO uint32_t STAT;
    __IO uint32_t INTENSET;
    __O  uint32_t INTENCLR;
    __IO uint32_t TIMEOUT;
    union
    {
        __IO uint32_t CLKDIV;
        __IO uint32_t DIV;
    };
    __IO uint32_t INTSTAT;
         uint32_t RESERVED0;
    __IO uint32_t MSTCTL;
    __IO uint32_t MSTTIME;
    __IO uint32_t MSTDAT;
         uint32_t RESERVED1[5];
    __IO uint32_t SLVCTL;
    __IO uint32_t SLVDAT;
    __IO uint32_t SLVADR0;
    __IO uint32_t SLVADR1;
    __IO uint32_t SLVADR2;
    __IO uint32_t SLVADR3;
    __IO uint32_t SLVQUAL0;
         uint32_t RESERVED2[9];
    __I  uint32_t MONRXDAT;
} LPC_I2C_T;




// ------------ State Configurable Timer (SCT) --------------------------------
#define SCT_NUM_EVENTS      (8)             // Number of events
#define SCT_NUM_REGISTERS   (8)             // Number of match/compare registers
#define SCT_NUM_OUTPUTS     (7)             // Number of outputs

typedef struct
{
    __IO  uint32_t CONFIG;                  // (offset: 0x00)
    union
    {
        __IO uint32_t CTRL;                 // (offset: 0x04)
        struct
        {
            __IO uint16_t CTRL_L;
            __IO uint16_t CTRL_H;
        };
    };
    union
    {
        __IO uint32_t LIMIT;                // (offset: 0x08)
        struct
        {
            __IO uint16_t LIMIT_L;
            __IO uint16_t LIMIT_H;
        };
    };
    union
    {
        __IO uint32_t HALT;                 // (offset: 0x0C)
        struct
        {
            __IO uint16_t HALT_L;
            __IO uint16_t HALT_H;
        };
    };
    union
    {
        __IO uint32_t STOP;                 // (offset: 0x10)
        struct
        {
            __IO uint16_t STOP_L;
            __IO uint16_t STOP_H;
        };
    };
    union
    {
        __IO uint32_t START;                // (offset: 0x14)
        struct
        {
            __IO uint16_t START_L;
            __IO uint16_t START_H;
        };
    };
    uint32_t RESERVED0[10];                 // (offset: 0x18-0x3C) RESERVED
    union
    {
        __IO uint32_t COUNT;                // (offset: 0x40)
        struct
        {
            __IO uint16_t COUNT_L;
            __IO uint16_t COUNT_H;
        };
    };
    union
    {
        __IO uint32_t STATE;                // (offset: 0x44)
        struct
        {
            __IO uint16_t STATE_L;
            __IO uint16_t STATE_H;
        };
    };
    __I  uint32_t INPUT;                    // (offset: 0x48)
    union
    {
        __IO uint32_t REGMODE;              // (offset: 0x4C)
        struct
        {
            __IO uint16_t REGMODE_L;
            __IO uint16_t REGMODE_H;
        };
    };
    __IO uint32_t OUTPUT;                   // (offset: 0x050)
    __IO uint32_t OUTPUTDIRCTRL;            // (offset: 0x054)
    __IO uint32_t RES;                      // (offset: 0x058)
    __IO uint32_t DMAREQ0;                  // (offset: 0x05C)
    __IO uint32_t DMAREQ1;                  // (offset: 0x060)
         uint32_t RESERVED1[35];            // (offset: 0x064-0x0EC) RESERVED
    __IO uint32_t EVEN;                     // (offset: 0x0F0)
    __IO uint32_t EVFLAG;                   // (offset: 0x0F4)
    __IO uint32_t CONEN;                    // (offset: 0x0F8)
    __IO uint32_t CONFLAG;                  // (offset: 0x0FC)
    union                                   // (offset: 0x100-0x13C) Match / Capture
    {
        __IO union
        {
            uint32_t U;                     // MATCH[i].U  Unified 32-bit register
            struct
            {
                uint16_t L;                 // MATCH[i].L  Access to L value
                uint16_t H;                 // MATCH[i].H  Access to H value
            };
        } MATCH[SCT_NUM_REGISTERS];

