hparracho/Xarmlib/include/targets/LPC84x/lpc84x_cmsis.h
        __I union
        {
            uint32_t U;                     // CAP[i].U  Unified 32-bit register
            struct
            {
                uint16_t L;                 // CAP[i].L  Access to L value
                uint16_t H;                 // CAP[i].H  Access to H value
            };
        } CAP[SCT_NUM_REGISTERS];
    };
    uint32_t RESERVED2[32 - SCT_NUM_REGISTERS];         // (offset: 0x...-0x17C) RESERVED
    union
    {
        __IO uint16_t MATCH_L[SCT_NUM_REGISTERS];       // (offset: 0x180-0x...) Match Value L counter
        __I  uint16_t CAP_L[SCT_NUM_REGISTERS];         // (offset: 0x180-0x...) Capture Value L counter
    };
    uint16_t RESERVED3[32 - SCT_NUM_REGISTERS];         // (offset: 0x...-0x1BE) RESERVED
    union
    {
        __IO uint16_t MATCH_H[SCT_NUM_REGISTERS];       // (offset: 0x1C0-0x...) Match Value H counter
        __I  uint16_t CAP_H[SCT_NUM_REGISTERS];         // (offset: 0x1C0-0x...) Capture Value H counter
    };
    uint16_t RESERVED4[32 - SCT_NUM_REGISTERS];         // (offset: 0x...-0x1FE) RESERVED
    union                                               // (offset: 0x200-0x...) Match Reload / Capture Control value
    {
        __IO union
        {
            uint32_t U;                                 // MATCHREL[i].U  Unified 32-bit register
            struct
            {
                uint16_t L;                             // MATCHREL[i].L  Access to L value
                uint16_t H;                             // MATCHREL[i].H  Access to H value
            };
        } MATCHREL[SCT_NUM_REGISTERS];
        __IO union
        {
            uint32_t U;                                 // CAPCTRL[i].U  Unified 32-bit register
            struct
            {
                uint16_t L;                             // CAPCTRL[i].L  Access to L value
                uint16_t H;                             // SCTCAPCTRL[i].H  Access to H value
            };
        } CAPCTRL[SCT_NUM_REGISTERS];
    };
    uint32_t RESERVED5[32 - SCT_NUM_REGISTERS];         // (offset: 0x...-0x27C) RESERVED
    union
    {
        __IO uint16_t MATCHREL_L[SCT_NUM_REGISTERS];    // (offset: 0x280-0x...) Match Reload value L counter
        __IO uint16_t CAPCTRL_L[SCT_NUM_REGISTERS];     // (offset: 0x280-0x...) Capture Control value L counter
    };
    uint16_t RESERVED6[32 - SCT_NUM_REGISTERS];         // (offset: 0x...-0x2BE) RESERVED
    union
    {
        __IO uint16_t MATCHREL_H[SCT_NUM_REGISTERS];    // (offset: 0x2C0-0x...) Match Reload value H counter
        __IO uint16_t CAPCTRL_H[SCT_NUM_REGISTERS];     // (offset: 0x2C0-0x...) Capture Control value H counter
    };
    uint16_t RESERVED7[32 - SCT_NUM_REGISTERS];         // (offset: 0x...-0x2FE) RESERVED
    __IO struct                                         // (offset: 0x300-0x3FC) EVENT[i].STATE / EVENT[i].CTRL
    {
        uint32_t STATE;
        uint32_t CTRL;
    } EVENT[SCT_NUM_EVENTS];
    uint32_t RESERVED8[128 - (2 * SCT_NUM_EVENTS)];     // (offset: 0x...-0x4FC) RESERVED
    __IO struct                                         // (offset: 0x500-0x57C) OUT[n].SET / OUT[n].CLR
    {
        uint32_t SET;                                   // Output n Set Register
        uint32_t CLR;                                   // Output n Clear Register
    } OUT[SCT_NUM_OUTPUTS];
    uint32_t RESERVED9[((0x300 / 4) - 1) - (2 * SCT_NUM_OUTPUTS)];  // (offset: 0x...-0x7F8) RESERVED
    __I  uint32_t MODULECONTENT;                                    // (offset: 0x7FC)       Module Content
} LPC_SCT_T;




// ------------ Standard Counter/Timer (CTIMER) -------------------------------
typedef struct
{
    __IO uint32_t IR;                       // (offset: 0x00)
    __IO uint32_t TCR;                      // (offset: 0x04)
    __IO uint32_t TC;                       // (offset: 0x08)
    __IO uint32_t PR;                       // (offset: 0x0C)
    __IO uint32_t PC;                       // (offset: 0x10)
    __IO uint32_t MCR;                      // (offset: 0x14)
    __IO uint32_t MR[4];                    // (offset: 0x18-0x24)
    __IO uint32_t CCR;                      // (offset: 0x28)
    __IO uint32_t CR[4];                    // (offset: 0x2C-0x38)
    __IO uint32_t EMR;                      // (offset: 0x3C)
         uint32_t RESERVED[12];             // (offset: 0x40-0x6C) RESERVED
    __IO uint32_t CTCR;                     // (offset: 0x70)
    __IO uint32_t PWMC;                     // (offset: 0x74)
} LPC_TIMER_T;




// ------------ Windowed Watchdog Timer (WWDT) --------------------------------
typedef struct
{
    __IO uint32_t MOD;                      // (offset: 0x000) Watchdog mode register
    __IO uint32_t TC;                       // (offset: 0x004) Watchdog timer constant register
    __O  uint32_t FEED;                     // (offset: 0x008) Watchdog feed sequence register
    __I  uint32_t TV;                       // (offset: 0x00C) Watchdog timer value register
         uint32_t RESERVED;                 // (offset: 0x010) RESERVED
    __IO uint32_t WARNINT;                  // (offset: 0x014) Watchdog timer warning int. register
    __IO uint32_t WINDOW;                   // (offset: 0x018) Watchdog timer window value register
} LPC_WWDT_T;




// ----------------------------------------------------------------------------
// Input multiplexing and DMA trigger multiplexing (INPUT MUX, DMA TRIGMUX)
// ----------------------------------------------------------------------------
typedef struct
{
    __IO uint32_t DMA_INMUX_INMUX0;         // (offset: 0x00)
    __IO uint32_t DMA_INMUX_INMUX1;         // (offset: 0x04)
         uint32_t RESERVED0[6];             // (offset: 0x08-0x1C) RESERVED
    __IO uint32_t SCT0_INMUX0;              // (offset: 0x20)
    __IO uint32_t SCT0_INMUX1;              // (offset: 0x24)
    __IO uint32_t SCT0_INMUX2;              // (offset: 0x28)
    __IO uint32_t SCT0_INMUX3;              // (offset: 0x2C)
         uint32_t RESERVED1[4];             // (offset: 0x30-0x3C) RESERVED
    __IO uint32_t DMA_ITRIG_INMUX0;         // (offset: 0x40)
    __IO uint32_t DMA_ITRIG_INMUX1;         // (offset: 0x44)
    __IO uint32_t DMA_ITRIG_INMUX2;         // (offset: 0x48)
    __IO uint32_t DMA_ITRIG_INMUX3;         // (offset: 0x4C)
    __IO uint32_t DMA_ITRIG_INMUX4;         // (offset: 0x50)
    __IO uint32_t DMA_ITRIG_INMUX5;         // (offset: 0x54)
    __IO uint32_t DMA_ITRIG_INMUX6;         // (offset: 0x58)
    __IO uint32_t DMA_ITRIG_INMUX7;         // (offset: 0x5C)
    __IO uint32_t DMA_ITRIG_INMUX8;         // (offset: 0x60)
    __IO uint32_t DMA_ITRIG_INMUX9;         // (offset: 0x64)
    __IO uint32_t DMA_ITRIG_INMUX10;        // (offset: 0x68)
    __IO uint32_t DMA_ITRIG_INMUX11;        // (offset: 0x6C)
    __IO uint32_t DMA_ITRIG_INMUX12;        // (offset: 0x70)
    __IO uint32_t DMA_ITRIG_INMUX13;        // (offset: 0x74)
    __IO uint32_t DMA_ITRIG_INMUX14;        // (offset: 0x78)
    __IO uint32_t DMA_ITRIG_INMUX15;        // (offset: 0x7C)
    __IO uint32_t DMA_ITRIG_INMUX16;        // (offset: 0x80)
    __IO uint32_t DMA_ITRIG_INMUX17;        // (offset: 0x84)
    __IO uint32_t DMA_ITRIG_INMUX18;        // (offset: 0x88)
    __IO uint32_t DMA_ITRIG_INMUX19;        // (offset: 0x8C)
    __IO uint32_t DMA_ITRIG_INMUX20;        // (offset: 0x90)
    __IO uint32_t DMA_ITRIG_INMUX21;        // (offset: 0x94)
    __IO uint32_t DMA_ITRIG_INMUX22;        // (offset: 0x98)
    __IO uint32_t DMA_ITRIG_INMUX23;        // (offset: 0x9C)
    __IO uint32_t DMA_ITRIG_INMUX24;        // (offset: 0xA0)
} LPC_INMUX_TRIGMUX_T;




