hparracho/Xarmlib/include/targets/LPC84x/lpc84x_cmsis.h
// ------------ Analog-to-Digital Converter (ADC) -----------------------------
typedef struct
{
    __IO uint32_t CTRL;                     // (offset: 0x00)
         uint32_t RESERVED0;                // (offset: 0x04) RESERVED
    __IO uint32_t SEQA_CTRL;                // (offset: 0x08)
    __IO uint32_t SEQB_CTRL;                // (offset: 0x0C)
    __IO uint32_t SEQA_GDAT;                // (offset: 0x10)
    __IO uint32_t SEQB_GDAT;                // (offset: 0x14)
         uint32_t RESERVED1[2];             // (offset: 0x18-0x1C) RESERVED
    __IO uint32_t DAT[12];                  // (offset: 0x20-0x4C)
    __IO uint32_t THR0_LOW;                 // (offset: 0x50)
    __IO uint32_t THR1_LOW;                 // (offset: 0x54)
    __IO uint32_t THR0_HIGH;                // (offset: 0x58)
    __IO uint32_t THR1_HIGH;                // (offset: 0x5C)
    __IO uint32_t CHAN_THRSEL;              // (offset: 0x60)
    __IO uint32_t INTEN;                    // (offset: 0x64)
    __IO uint32_t FLAGS;                    // (offset: 0x68)
    __IO uint32_t TRM;                      // (offset: 0x6C)
} LPC_ADC_T;




// ------------ Direct memory access (DMA) ------------------------------------
#define DMA_NUM_CHANNELS        25

typedef struct
{
    __IO uint32_t CFG;
    __I  uint32_t CTLSTAT;
    __IO uint32_t XFERCFG;
         uint32_t RESERVED;
} LPC_DMA_CHANNEL_T;

typedef struct
{
    __IO uint32_t       CTRL;                       // (offset: 0x000)
    __I  uint32_t       INTSTAT;                    // (offset: 0x004)
    __IO uint32_t       SRAMBASE;                   // (offset: 0x008)
         uint32_t       RESERVED0[5];               // (offset: 0x010-0x01C) RESERVED
    __IO uint32_t       ENABLESET0;                 // (offset: 0x020)
         uint32_t       RESERVED1;                  // (offset: 0x024)       RESERVED
    __O  uint32_t       ENABLECLR0;                 // (offset: 0x028)
         uint32_t       RESERVED2;                  // (offset: 0x02C)       RESERVED
    __I  uint32_t       ACTIVE0;                    // (offset: 0x030)
         uint32_t       RESERVED3;                  // (offset: 0x034)       RESERVED
    __I  uint32_t       BUSY0;                      // (offset: 0x038)
         uint32_t       RESERVED4;                  // (offset: 0x03C)       RESERVED
    __IO uint32_t       ERRINT0;                    // (offset: 0x040)
         uint32_t       RESERVED5;                  // (offset: 0x044)       RESERVED
    __IO uint32_t       INTENSET0;                  // (offset: 0x048)
         uint32_t       RESERVED6;                  // (offset: 0x04C)       RESERVED
    __O  uint32_t       INTENCLR0;                  // (offset: 0x050)
         uint32_t       RESERVED7;                  // (offset: 0x054)       RESERVED
    __IO uint32_t       INTA0;                      // (offset: 0x058)
         uint32_t       RESERVED8;                  // (offset: 0x05C)       RESERVED
    __IO uint32_t       INTB0;                      // (offset: 0x060)
         uint32_t       RESERVED9;                  // (offset: 0x064)       RESERVED
    __O  uint32_t       SETVALID0;                  // (offset: 0x068)
         uint32_t       RESERVED10;                 // (offset: 0x06C)       RESERVED
    __O  uint32_t       SETTRIG0;                   // (offset: 0x070)
         uint32_t       RESERVED11;                 // (offset: 0x074)       RESERVED
    __O  uint32_t       ABORT0;                     // (offset: 0x078)
         uint32_t       RESERVED12[225];            // (offset: 0x07C-0x3FC) RESERVED

    LPC_DMA_CHANNEL_T   CHANNEL[DMA_NUM_CHANNELS];  // (offset: 0x400-0x...)
} LPC_DMA_T;




// ------------ Digital-to-Analog Converter (DAC) -----------------------------
typedef struct
{
    __IO uint32_t CR;                       // (offset: 0x00)
    __IO uint32_t CTRL;                     // (offset: 0x04)
    __IO uint32_t CNTVAL;                   // (offset: 0x08)
} LPC_DAC_T;




// ------------ Capacitive Touch module (CAPT) --------------------------------
typedef struct
{
    __IO uint32_t CTRL;                     // (offset: 0x000)
    __IO uint32_t STATUS;                   // (offset: 0x004)
    __IO uint32_t POLL_TCNT;                // (offset: 0x008)
         uint32_t RESERVED0;                // (offset: 0x00C)
    __IO uint32_t INTENSET;                 // (offset: 0x010)
    __O  uint32_t INTENCLR;                 // (offset: 0x014)
    __I  uint32_t INTSTAT;                  // (offset: 0x018)
         uint32_t RESERVED1;                // (offset: 0x01C)       RESERVED
    __I  uint32_t TOUCH;                    // (offset: 0x020)
         uint32_t RESERVED2[1014];          // (offset: 0x024-0xFF8) RESERVED
    __I  uint32_t ID;                       // (offset: 0xFFC)
} LPC_CAPT_T;




// ------------ ROM API -------------------------------------------------------
// Power API functions
typedef struct
{
    void (*set_pll) (uint32_t cmd[], uint32_t resp[]);
    void (*set_power)(uint32_t cmd[], uint32_t resp[]);
    void (*set_fro_frequency)(uint32_t frequency);
    void (*power_mode_configure)(uint32_t power_mode, uint32_t peripheral_ctrl);
    void (*set_aclkgate)(uint32_t aclkgate);
    uint32_t (*get_aclkgate)(void);
} LPC_ROM_PWR_API_T;

// Integer divide API functions
typedef struct
{
    int32_t quot;   // Quotient
    int32_t rem;    // Remainder
} LPC_IDIV_RETURN_T;

typedef struct
{
    uint32_t quot;  // Quotient
    uint32_t rem;   // Reminder
} LPC_UIDIV_RETURN_T;

typedef struct
{
     int32_t (* idiv)( int32_t numerator,  int32_t denominator);                // Signed integer division
    uint32_t (*uidiv)(uint32_t numerator, uint32_t denominator);                // Unsigned integer division

    LPC_IDIV_RETURN_T  (* idivmod)( int32_t numerator,  int32_t denominator);   // Signed integer division with remainder
    LPC_UIDIV_RETURN_T (*uidivmod)(uint32_t numerator, uint32_t denominator);   // Unsigned integer division with remainder
} LPC_ROM_DIV_API_T;

// The master structure that defines the table of all ROM APIs on the device - ROM Driver table
typedef struct
{
  const uint32_t            RESERVED0[3];   // (offset: 0x00-0x08) RESERVED
  const LPC_ROM_PWR_API_T*  PWR_BASE_PTR;   // (offset: 0x0C)      Power APIs function table base address
  const LPC_ROM_DIV_API_T*  DIV_BASE_PTR;   // (offset: 0x10)      Integer division routines function table base address
  const uint32_t            RESERVED1[7];   // (Offsets 0x14-0x2C) RESERVED
} LPC_ROM_API_T;




// ISO C++ prohibits anonymous structs [-Wpedantic]
// #pragma GCC diagnostic ignored "-Wpedantic"
#pragma GCC diagnostic pop




//-------------------------------------------------------------------------
// Peripheral memory map
//-------------------------------------------------------------------------
// Base addresses
#define LPC_FLASH_BASE          (0x00000000UL)
#define LPC_ROM_BASE            (0x0F000000UL)
#define LPC_RAM_BASE            (0x10000000UL)
#define LPC_APB_BASE            (0x40000000UL)
#define LPC_AHB_BASE            (0x50000000UL)
#define LPC_GPIO_BASE           (0xA0000000UL)

// ROM Driver table
#define LPC_ROM_DRIVER_BASE     (LPC_ROM_BASE + 0x1FF8)

// APB0 peripherals
#define LPC_WWDT_BASE           (LPC_APB_BASE + 0x00000)
#define LPC_MRT_BASE            (LPC_APB_BASE + 0x04000)
#define LPC_WKT_BASE            (LPC_APB_BASE + 0x08000)
#define LPC_SWM_BASE            (LPC_APB_BASE + 0x0C000)
#define LPC_DAC0_BASE           (LPC_APB_BASE + 0x14000)
#define LPC_DAC1_BASE           (LPC_APB_BASE + 0x18000)
#define LPC_ADC_BASE            (LPC_APB_BASE + 0x1C000)
#define LPC_PMU_BASE            (LPC_APB_BASE + 0x20000)
#define LPC_CMP_BASE            (LPC_APB_BASE + 0x24000)
// RESERVED                     (LPC_APB_BASE + 0x28000)
#define LPC_INMUX_TRIGMUX_BASE  (LPC_APB_BASE + 0x2C000)
#define LPC_I2C2_BASE           (LPC_APB_BASE + 0x30000)
#define LPC_I2C3_BASE           (LPC_APB_BASE + 0x34000)
#define LPC_CTIMER0_BASE        (LPC_APB_BASE + 0x38000)
// RESERVED                     (LPC_APB_BASE + 0x38000)
#define LPC_FMC_BASE            (LPC_APB_BASE + 0x40000)
#define LPC_IOCON_BASE          (LPC_APB_BASE + 0x44000)
#define LPC_SYSCON_BASE         (LPC_APB_BASE + 0x48000)
#define LPC_I2C0_BASE           (LPC_APB_BASE + 0x50000)
#define LPC_I2C1_BASE           (LPC_APB_BASE + 0x54000)
#define LPC_SPI0_BASE           (LPC_APB_BASE + 0x58000)
#define LPC_SPI1_BASE           (LPC_APB_BASE + 0x5C000)
#define LPC_CAPT_BASE           (LPC_APB_BASE + 0x60000)
#define LPC_USART0_BASE         (LPC_APB_BASE + 0x64000)
#define LPC_USART1_BASE         (LPC_APB_BASE + 0x68000)
#define LPC_USART2_BASE         (LPC_APB_BASE + 0x6C000)
#define LPC_USART3_BASE         (LPC_APB_BASE + 0x70000)
#define LPC_USART4_BASE         (LPC_APB_BASE + 0x74000)

// AHB peripherals
#define LPC_CRC_BASE            (LPC_AHB_BASE + 0x00000)
#define LPC_SCT_BASE            (LPC_AHB_BASE + 0x04000)
#define LPC_DMA_BASE            (LPC_AHB_BASE + 0x08000)
#define LPC_MTB_SFR_BASE        (LPC_AHB_BASE + 0x0C000)
#define LPC_FAIM_BASE           (LPC_AHB_BASE + 0x10000)

// GPIO interrupts
#define LPC_PIN_INT_BASE        (LPC_GPIO_BASE + 0x4000)




//-------------------------------------------------------------------------
// Peripheral declarations
//-------------------------------------------------------------------------
// ROM API
#define LPC_ROM_API            (*(LPC_ROM_API_T    * *) LPC_ROM_DRIVER_BASE)
#define LPC_ROM_PWR_API         ((LPC_ROM_PWR_API_T  *)(LPC_ROM_API->PWR_BASE_PTR))
#define LPC_ROM_DIV_API         ((LPC_ROM_DIV_API_T  *)(LPC_ROM_API->DIV_BASE_PTR))

// APB0 peripherals
#define LPC_WWDT                ((LPC_WWDT_T         *) LPC_WWDT_BASE)
#define LPC_MRT                 ((LPC_MRT_T          *) LPC_MRT_BASE)
#define LPC_WKT                 ((LPC_WKT_T          *) LPC_WKT_BASE)
#define LPC_SWM                 ((LPC_SWM_T          *) LPC_SWM_BASE)
#define LPC_DAC0                ((LPC_DAC_T          *) LPC_DAC0_BASE)
#define LPC_DAC1                ((LPC_DAC_T          *) LPC_DAC1_BASE)
#define LPC_ADC                 ((LPC_ADC_T          *) LPC_ADC_BASE)
#define LPC_PMU                 ((LPC_PMU_T          *) LPC_PMU_BASE)
#define LPC_CMP                 ((LPC_CMP_T          *) LPC_CMP_BASE)
#define LPC_INMUX_TRIGMUX       ((LPC_INMUX_TRIGMUX_T*) LPC_INMUX_TRIGMUX_BASE)
#define LPC_I2C2                ((LPC_I2C_T          *) LPC_I2C2_BASE)
#define LPC_I2C3                ((LPC_I2C_T          *) LPC_I2C3_BASE)
#define LPC_CTIMER0             ((LPC_TIMER_T        *) LPC_CTIMER0_BASE)
#define LPC_FMC                 ((LPC_FMC_T          *) LPC_FMC_BASE)
#define LPC_IOCON               ((LPC_IOCON_T        *) LPC_IOCON_BASE)
#define LPC_SYSCON              ((LPC_SYSCON_T       *) LPC_SYSCON_BASE)
#define LPC_I2C0                ((LPC_I2C_T          *) LPC_I2C0_BASE)
#define LPC_I2C1                ((LPC_I2C_T          *) LPC_I2C1_BASE)
#define LPC_SPI0                ((LPC_SPI_T          *) LPC_SPI0_BASE)
#define LPC_SPI1                ((LPC_SPI_T          *) LPC_SPI1_BASE)
#define LPC_CAPT                ((LPC_CAPT_T         *) LPC_CAPT_BASE)
#define LPC_USART0              ((LPC_USART_T        *) LPC_USART0_BASE)
#define LPC_USART1              ((LPC_USART_T        *) LPC_USART1_BASE)
#define LPC_USART2              ((LPC_USART_T        *) LPC_USART2_BASE)
#define LPC_USART3              ((LPC_USART_T        *) LPC_USART3_BASE)
#define LPC_USART4              ((LPC_USART_T        *) LPC_USART4_BASE)

// AHB peripherals
#define LPC_CRC                 ((LPC_CRC_T          *) LPC_CRC_BASE)
#define LPC_SCT                 ((LPC_SCT_T          *) LPC_SCT_BASE)
#define LPC_SCT0                ((LPC_SCT_T          *) LPC_SCT_BASE)
#define LPC_DMA                 ((LPC_DMA_T          *) LPC_DMA_BASE)
#define LPC_GPIO                ((LPC_GPIO_T         *) LPC_GPIO_BASE)

// GPIO interrupts
#define LPC_PIN_INT             ((LPC_PIN_INT_T      *) LPC_PIN_INT_BASE)




//-------------------------------------------------------------------------
// Other chip-specific macro definitions
//-------------------------------------------------------------------------

// CAP Touch pins to IOCON mapping
#define CAPTOUCH_X0_PORT        PIO0_31
#define CAPTOUCH_X1_PORT        PIO1_0
#define CAPTOUCH_X2_PORT        PIO1_1
#define CAPTOUCH_X3_PORT        PIO1_2
#define CAPTOUCH_X4_PORT        PIO1_3
#define CAPTOUCH_X5_PORT        PIO1_4
#define CAPTOUCH_X6_PORT        PIO1_5
#define CAPTOUCH_X7_PORT        PIO1_6
#define CAPTOUCH_X8_PORT        PIO1_7
#define CAPTOUCH_YL_PORT        PIO1_8
#define CAPTOUCH_YH_PORT        PIO1_9

// ACMP_I-to-IOCON mapping
#define ACMP_I1_PORT            PIO0_0
#define ACMP_I2_PORT            PIO0_1
#define ACMP_I3_PORT            PIO0_14
#define ACMP_I4_PORT            PIO0_23
#define ACMP_I5_PORT            PIO0_30




#ifdef __cplusplus
}
#endif

#endif // __XARMLIB_TARGETS_LPC84X_LPC84X_CMSIS_H
